MIN_SEARCH_STR_LEN = 3
ID_ROLE = 110
SORT_ROLE = 111
FULL_VALUE_ROLE = 112
IS_EXT_ROLE = 113
TABLE_BUTTONS = {'reload':'Оновити', 'create':'Створити', 'edit':'Редагувати', 'copy':'Копіювати', 'delete':'Видалити'}
# access constant
ACCESS = [
    "Авторизуватись",
    "Вийти з програми",
    "Читати інформацію про користувачів",
    "Створити користувача",
    "Редагувати користувача",
    "Видалити користувача",
    "Читати інформацію про контрагентів",
    "Створити контрагента",
    "Редагувати контрагента",
    "Видалити контрагента",
    "Читати документи",
    "Читати власні документи",
    "Створити документ",
    "Редагувати документи",
    "Редагувати власні документи",
    "Видалити документ",
    "Читати довідники",
    "Створити запис в довіднику",
    "Редагувати запис в довіднику",
    "Видалити запис в довіднику",
    "Читати власні рахунки",
    "Додати власний рахунок",
    "Редагувати власний рахунок",
    "Видалити власний рахунок",
    "Користуватися чатом",
    "Керувати налаштуваннями",
]